Alignments to base points cannot be constrained.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotConstrainBasePointAlignments { get; }
  Visual Basic
Public Shared ReadOnly Property CannotConstrainBasePointAlignments As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotConstrainBasePointAlignments {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace